package week_4;

public class w4_question {
//    1.     나이와 성적을 입력 받아 나이가 30세 미만이고, 성적이 3.5 이상이면 “추천 대상입니다”를 출력하고 그렇지 않으면 “추천 대상이 아닙니다”를 출력하는 프로그램을 작성하시오.
//    3.     성별이 여자이면서 토익 성적이 700점 이상인 경우 또는 성별이 남자이면서 토익 성적이 800점 이상인 경우에만 “항공 승무원 지원 자격 가능자입니다”를 출력하는 프로그램을 작성하시오.
//    5.     마트에서 구입한 물건 값과 구입 시간을 입력 받아 실제 지불한 금액을 출력하는 프로그램을 작성하시어. 마트는 시간대별로 할인율을 다르게 적용한다.
//          [ 오전 12시 이전 : 구입 금액의 5% 할인
//          오전 12시 이후(12시 포함) : 구입 금액의 2.5% 할인 ]
//    { 실행 결과 }
//    구입 시간 : 10시
//    총 구입 금액 : 100000
//    실제 지불 금액 : 95000
//
//    7.     첫 번째로 숫자를, 두 번째로 연산자(+, -)를, 세 번째로 숫자를 입력 받아 두 번째로 지정된 연산을 수행하고 그 결과가 0보다 크면 “수식의 결과는 양수입니다”,
//    0이면 “수식의 결과가 0ㅇㅂ니다”, 0보다 작으면 “수식의 결과가 음수입니다”를 출력하는 프로그램을 작성하시오.
}
