//package week_9;
//과제: 클래스와 오브젝트
//        1. 실 세계에서 사용 가능한 의미 있는 클래스를 작성한다.
//        작성한 클래스의 객체를 생성하여, 객체의 멤버들의 값을 출력한다.

//        2. 실 세계에서 사용 가능한 의미 있는 클래스를 작성한다(1번 클래스 재 사용 가능).
//        작성한 클래스의 객체 배열을 생성하여, 객체 배열안에 있는 객체들의 멤버들의 값을 출력한다.
//        (즉, 객체 값 리스트를 출력한다.)
//
//        3. 2에서 작성한 객체 배열을 사용하여,
//        의미 있는 출력을 하는 메소드를 5개 이상 작성하고 각 메소드의 결과를 출력한다.
//        예를 들어, Person 클래스의 경우
//        번호, 이름, 주소, 전화번호, 성별로 구성된다고 하면,

//        a. Person 객체 배열의 크기를 출력한다.
//        b.  Person 객체 배열의 이름이 김으로 시작하는 사람의 갯수를 출력한다.
//        c.  Person 객체 배열의 이름이 김으로 시작하는 사람의 이름을 출력한다.
//        d. c.d를 함께 출력한다.
//        e. Person 객체 배열에서 남자의 수, 여자의 수를 출력한다.
//        f.  Person 객체 배열에서 남자만 출력한다.
//        g.  Person 객체 배열에서 여자만 출력한다.


//public class w9_question {
//}
