package week_6;
//*다음 문제를 JAVA 언어 반복문을 사용하여 작성하시오.

//        1.     하나의 숫자를 입력 받아 1부터 입력된 숫자까지의
//        합을 구하는 프로그램을 작성하시오. 단, 매 10단위마다 중간 결과를 출력하시오.
//        { ( 45 입력 )
//        1 - 10까지의 합 : 00
//        1 – 20까지의 합 : 000
//        1 - 30까지의 합 : 000
//        1 – 40까지의 합 : 000
//        1 - 45까지의 합 : 000 }
//
//        2.     반복적으로 3과목의 성적을 입력 받아 총점과 평균을 출력하는 프로그램을
//        for문을 사용하여 작성하시오. 3과목의 점수가 모두 0점일 경우 프로그램은
//        현재까지의 처리 인원을 출력하고 프로그램을 종료한다.

//        { 1번째 학생 : 총점 000점, 평균 00점
//        2번째 학생 : 총점 000점, 평균 00점
//        . . . . . . . . . . . . . . . . .
//        00번째 학생 : 총점 000, 평균 00점
//        총 12명을 성적 처리하였습니다. }

//        3.     구구단 2단을 다음과 같이 출력하는 프로그램을 for 반복문을 사용하여 작성하시오.
//        { ** 2단 **
//        2 * 1 = 2
//        2  3 = 6
//        2 * 5 = 10
//        2 * 7 = 14
//        2 * 9 = 18 }
//
//        4.     ① 3 + 6 + 9 + 12 + 15 + … + N 형태로 수를 더한다.
//        ② 하나의 숫자를 입력 받는다.
//        ③ 3의 배수의 총합이 입력된 숫자를 넘었을 때의 N값과 총 합계,
//        N값이 몇 번째 인지를 구하는 프로그램을 for 반복문을 사용해 작성하시오.
//        { 사용자 입력 : 10
//        10을 넘었을 때의 값 : 12
//        10을 넘었을 때까지의 총 합계 : 18
//        10을 넘었을 때까지 몇 번째 3의 배수인가 : 4 }
//
//        6. 다음과 같이 출력하는 프로그램을 while문과 for문을 사용하여 작성하시오.
//        { 1 2 3 4 5
//        6 7 8 9 10
//        11 12 13 14 15
//        16 17 18 19 20
//        21 22 23 24 25 }
//
//        7.     다음과 같은 순서의 숫자들은 어떤 논리적 순서에 의해 나열되어 있다.
//        이 순서를 만족하는 숫자 15개를 출력하는 프로그램을 작성하시오.
//        아래 문제는 숫자를 1씩 증가시켜 그 전 값에 더하여 출력하고 있다.
//        [ 1, 2, 4, 7, 11, 16, 22 . . . . . ]
//
//        8.     사용자로부터 하나의 숫자를 입력 받아 1부터 입력 받은 숫자
//        사이의 소수를 구하여 출력하는 프로그램을 작성하시오.
//        [ 소수 : 1과 자신의 수 이외에는 나뉘지 않는 수 ( 1 제외 )
public class w6_question {
}
