package week_7;
//과제: 다음 문제를 JAVA 배열을 사용하여 작성하여 제출하시오.
//
//        1.     다음과 같은 배열을 프로그램 실행 시 생성하고 가장 큰 값과
//        가장 작은 값을 구하여 출력하는 프로그램을 작성하시오.
//        [ 배열 : 234 89 678 55 785 66 ]
//        { 가장 큰 값 : 785
//        가장 작은 값 : 55 }
//
//        2.     다음과 같은 배열을 프로그램 실행 시 생성하고 가장 큰 값과
//        가장 작은 값을 제외한 나머지 값의 합과 평균을 구하여 출력하는 프로그램을 작성하시오.
//        [ 배열 : 234 44 89 678 55 785 66 88 ]
//        { 가장 큰 값과 작은 값을 제외한 합 : 000
//        가장 큰 값과 작은 값을 제외한 평균 : 000.00 }
//
//        3.     다음과 같은 10개의 숫자 배열을 생성하고 배열의 각 데이터가 한 칸씩 왼쪽으로
//        이동하여 다시 저장되도록 하는 프로그램을 작성하시오.
//        단, 초기 배열의 가장 왼쪽 데이터는 가장 오른쪽으로 이동한다.
//        초기 배열 값과 이동 후 배열 값을 출력하시오.
//        [ 배열 : 33 2 189 72 7 91 5 14 17 9 ]
//        { 초기 배열 값 : 33 2 189 72 7 91 5 14 17 9
//        이동 후 배열 값 : 2 189 72 7 91 5 14 17 9 33 }
//
//        4.     다음과 같은 문자 배열을
//        프로그램 실행 시 생성하고 알파벳순(내림차순)으로 정렬하는 프로그램을 작성하시오.
//        [ 배열 : kim park oh lim pang seo lee yang bae back ]
//        { 정렬 전 : : kim park oh lim pang seo lee yang bae back
//        정렬 후 : back bae kim lee lim oh pang park seo yang }

//          5, 6, 7, 8번은 홈페이지 참고
public class w7_question {
}
